## Plan Result




### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!


<pre><code>Plan: 1 to add, 6 to change, 1 to destroy.</code></pre>

* Update
  * module.prow_gatekeeper.kubectl_manifest.gatekeeper["/apis/apps/v1/namespaces/gatekeeper-system/deployments/gatekeeper-audit"]
  * module.prow_gatekeeper.kubectl_manifest.gatekeeper["/apis/apps/v1/namespaces/gatekeeper-system/deployments/gatekeeper-controller-manager"]
  * module.trusted_workload_gatekeeper.kubectl_manifest.gatekeeper["/apis/apps/v1/namespaces/gatekeeper-system/deployments/gatekeeper-audit"]
  * module.trusted_workload_gatekeeper.kubectl_manifest.gatekeeper["/apis/apps/v1/namespaces/gatekeeper-system/deployments/gatekeeper-controller-manager"]
  * module.untrusted_workload_gatekeeper.kubectl_manifest.gatekeeper["/apis/apps/v1/namespaces/gatekeeper-system/deployments/gatekeeper-audit"]
  * module.untrusted_workload_gatekeeper.kubectl_manifest.gatekeeper["/apis/apps/v1/namespaces/gatekeeper-system/deployments/gatekeeper-controller-manager"]
* Replace
  * google_container_node_pool.components_pool



<details><summary>Change Result (Click me)</summary>

```hcl

  # google_container_node_pool.components_pool must be replaced
-/+ resource "google_container_node_pool" "components_pool" {
      ~ id                          = "projects/sap-kyma-prow/locations/europe-west4/clusters/trusted-workload-kyma-prow/nodePools/components-pool" -> (known after apply)
      ~ initial_node_count          = 0 -> (known after apply)
      ~ instance_group_urls         = [
          - "https://www.googleapis.com/compute/v1/projects/sap-kyma-prow/zones/europe-west4-a/instanceGroupManagers/gke-trusted-workload--components-pool-5f423fdc-grp",
          - "https://www.googleapis.com/compute/v1/projects/sap-kyma-prow/zones/europe-west4-c/instanceGroupManagers/gke-trusted-workload--components-pool-13c0e5b0-grp",
          - "https://www.googleapis.com/compute/v1/projects/sap-kyma-prow/zones/europe-west4-b/instanceGroupManagers/gke-trusted-workload--components-pool-e7895f9f-grp",
        ] -> (known after apply)
      ~ location                    = "europe-west4" -> (known after apply)
      ~ managed_instance_group_urls = [
          - "https://www.googleapis.com/compute/v1/projects/sap-kyma-prow/zones/europe-west4-a/instanceGroups/gke-trusted-workload--components-pool-5f423fdc-grp",
          - "https://www.googleapis.com/compute/v1/projects/sap-kyma-prow/zones/europe-west4-c/instanceGroups/gke-trusted-workload--components-pool-13c0e5b0-grp",
          - "https://www.googleapis.com/compute/v1/projects/sap-kyma-prow/zones/europe-west4-b/instanceGroups/gke-trusted-workload--components-pool-e7895f9f-grp",
        ] -> (known after apply)
      + max_pods_per_node           = (known after apply)
        name                        = "components-pool"
      + name_prefix                 = (known after apply)
      ~ node_count                  = 0 -> (known after apply)
      ~ node_locations              = [
          - "europe-west4-a",
          - "europe-west4-b",
          - "europe-west4-c",
        ] -> (known after apply)
      + operation                   = (known after apply)
      ~ project                     = "sap-kyma-prow" -> (known after apply)
      ~ version                     = "1.26.5-gke.1200" -> (known after apply)
        # (1 unchanged attribute hidden)

      ~ autoscaling {
          ~ max_node_count       = 1 -> 2
          - total_max_node_count = 0 -> null
          - total_min_node_count = 0 -> null
            # (2 unchanged attributes hidden)
        }

      ~ management {
          ~ auto_repair  = true -> (known after apply)
          ~ auto_upgrade = true -> (known after apply)
        }

      ~ network_config {
          ~ create_pod_range     = false -> (known after apply)
          ~ enable_private_nodes = false -> (known after apply)
          + pod_ipv4_cidr_block  = (known after apply)
          + pod_range            = (known after apply)

          + pod_cidr_overprovision_config {
              + disabled = (known after apply)
            }
        }

      ~ node_config {
          ~ disk_size_gb      = 100 -> (known after apply)
          ~ disk_type         = "pd-balanced" -> (known after apply)
          ~ guest_accelerator = [] -> (known after apply)
          ~ image_type        = "COS_CONTAINERD" -> (known after apply)
          ~ local_ssd_count   = 0 -> (known after apply)
          ~ machine_type      = "n1-standard-2" -> "e2-medium" # forces replacement
          + min_cpu_platform  = (known after apply)
          ~ oauth_scopes      = [
              - "https://www.googleapis.com/auth/devstorage.read_only",
              - "https://www.googleapis.com/auth/logging.write",
              - "https://www.googleapis.com/auth/monitoring",
              - "https://www.googleapis.com/auth/service.management.readonly",
              - "https://www.googleapis.com/auth/servicecontrol",
              - "https://www.googleapis.com/auth/trace.append",
            ] -> (known after apply)
          - resource_labels   = {} -> null
          ~ service_account   = "default" -> (known after apply)
          - tags              = [] -> null
            # (6 unchanged attributes hidden)

          ~ shielded_instance_config {
              ~ enable_integrity_monitoring = true -> (known after apply)
              ~ enable_secure_boot          = false -> (known after apply)
            }

            # (1 unchanged block hidden)
        }

      ~ upgrade_settings {
          ~ max_surge       = 1 -> (known after apply)
          ~ max_unavailable = 0 -> (known after apply)
          ~ strategy        = "SURGE" -> (known after apply)

          + blue_green_settings {
              + node_pool_soak_duration = (known after apply)

              + standard_rollout_policy {
                  + batch_node_count    = (known after apply)
                  + batch_percentage    = (known after apply)
                  + batch_soak_duration = (known after apply)
                }
            }
        }
    }

  # module.prow_gatekeeper.kubectl_manifest.gatekeeper["/apis/apps/v1/namespaces/gatekeeper-system/deployments/gatekeeper-audit"] will be updated in-place
  ~ resource "kubectl_manifest" "gatekeeper" {
        id                      = "/apis/apps/v1/namespaces/gatekeeper-system/deployments/gatekeeper-audit"
        name                    = "gatekeeper-audit"
      ~ yaml_body               = (sensitive value)
      ~ yaml_body_parsed        = <<-EOT
            apiVersion: apps/v1
            kind: Deployment
            metadata:
              labels:
                control-plane: audit-controller
                gatekeeper.sh/operation: audit
                gatekeeper.sh/system: "yes"
              name: gatekeeper-audit
              namespace: gatekeeper-system
            spec:
              replicas: 1
              selector:
                matchLabels:
                  control-plane: audit-controller
                  gatekeeper.sh/operation: audit
                  gatekeeper.sh/system: "yes"
              template:
                metadata:
                  labels:
                    control-plane: audit-controller
                    gatekeeper.sh/operation: audit
                    gatekeeper.sh/system: "yes"
                spec:
                  automountServiceAccountToken: true
                  containers:
                  - args:
                    - --operation=audit
                    - --operation=status
                    - --operation=mutation-status
                    - --logtostderr
                    - --disable-opa-builtin={http.send}
                    - --disable-cert-rotation
                    command:
                    - /manager
                    env:
                    - name: POD_NAMESPACE
                      valueFrom:
                        fieldRef:
                          apiVersion: v1
                          fieldPath: metadata.namespace
                    - name: POD_NAME
                      valueFrom:
                        fieldRef:
                          fieldPath: metadata.name
                    - name: NAMESPACE
                      valueFrom:
                        fieldRef:
                          apiVersion: v1
                          fieldPath: metadata.namespace
                    - name: CONTAINER_NAME
                      value: manager
                    image: openpolicyagent/gatekeeper:v3.13.0-beta.0
                    imagePullPolicy: Always
                    livenessProbe:
                      httpGet:
                        path: /healthz
                        port: 9090
                    name: manager
                    ports:
                    - containerPort: 8888
                      name: metrics
                      protocol: TCP
                    - containerPort: 9090
                      name: healthz
                      protocol: TCP
                    readinessProbe:
                      httpGet:
                        path: /readyz
                        port: 9090
                    resources:
                      limits:
                        memory: 512Mi
                      requests:
                        cpu: 100m
                        memory: 512Mi
                    securityContext:
                      allowPrivilegeEscalation: false
                      capabilities:
                        drop:
                        - ALL
                      readOnlyRootFilesystem: true
                      runAsGroup: 999
                      runAsNonRoot: true
                      runAsUser: 1000
                      seccompProfile:
                        type: RuntimeDefault
                    volumeMounts:
                    - mountPath: /certs
                      name: cert
                      readOnly: true
                    - mountPath: /tmp/audit
                      name: tmp-volume
                  nodeSelector:
                    kubernetes.io/os: linux
          -         workload: components
                  priorityClassName: system-cluster-critical
                  serviceAccountName: gatekeeper-admin
                  terminationGracePeriodSeconds: 60
          -       tolerations:
          -       - effect: NoSchedule
          -         key: components.gke.io/gke-managed-components
          -         operator: Exists
                  volumes:
                  - name: cert
                    secret:
                      defaultMode: 420
                      secretName: gatekeeper-webhook-server-cert
                  - emptyDir: {}
                    name: tmp-volume
        EOT
        # (13 unchanged attributes hidden)
    }

  # module.prow_gatekeeper.kubectl_manifest.gatekeeper["/apis/apps/v1/namespaces/gatekeeper-system/deployments/gatekeeper-controller-manager"] will be updated in-place
  ~ resource "kubectl_manifest" "gatekeeper" {
        id                      = "/apis/apps/v1/namespaces/gatekeeper-system/deployments/gatekeeper-controller-manager"
        name                    = "gatekeeper-controller-manager"
      ~ yaml_body               = (sensitive value)
      ~ yaml_body_parsed        = <<-EOT
            apiVersion: apps/v1
            kind: Deployment
            metadata:
              labels:
                control-plane: controller-manager
                gatekeeper.sh/operation: webhook
                gatekeeper.sh/system: "yes"
              name: gatekeeper-controller-manager
              namespace: gatekeeper-system
            spec:
              replicas: 3
              selector:
                matchLabels:
                  control-plane: controller-manager
                  gatekeeper.sh/operation: webhook
                  gatekeeper.sh/system: "yes"
              template:
                metadata:
                  labels:
                    control-plane: controller-manager
                    gatekeeper.sh/operation: webhook
                    gatekeeper.sh/system: "yes"
                spec:
                  affinity:
                    podAntiAffinity:
                      preferredDuringSchedulingIgnoredDuringExecution:
                      - podAffinityTerm:
                          labelSelector:
                            matchExpressions:
                            - key: gatekeeper.sh/operation
                              operator: In
                              values:
                              - webhook
                          topologyKey: kubernetes.io/hostname
                        weight: 100
                  automountServiceAccountToken: true
                  containers:
                  - args:
                    - --port=8443
                    - --logtostderr
                    - --exempt-namespace=gatekeeper-system
                    - --operation=webhook
                    - --operation=mutation-webhook
                    - --disable-opa-builtin={http.send}
                    command:
                    - /manager
                    env:
                    - name: POD_NAMESPACE
                      valueFrom:
                        fieldRef:
                          apiVersion: v1
                          fieldPath: metadata.namespace
                    - name: POD_NAME
                      valueFrom:
                        fieldRef:
                          fieldPath: metadata.name
                    - name: NAMESPACE
                      valueFrom:
                        fieldRef:
                          apiVersion: v1
                          fieldPath: metadata.namespace
                    - name: CONTAINER_NAME
                      value: manager
                    image: openpolicyagent/gatekeeper:v3.13.0-beta.0
                    imagePullPolicy: Always
                    livenessProbe:
                      httpGet:
                        path: /healthz
                        port: 9090
                    name: manager
                    ports:
                    - containerPort: 8443
                      name: webhook-server
                      protocol: TCP
                    - containerPort: 8888
                      name: metrics
                      protocol: TCP
                    - containerPort: 9090
                      name: healthz
                      protocol: TCP
                    readinessProbe:
                      httpGet:
                        path: /readyz
                        port: 9090
                    resources:
                      limits:
                        memory: 512Mi
                      requests:
                        cpu: 100m
                        memory: 512Mi
                    securityContext:
                      allowPrivilegeEscalation: false
                      capabilities:
                        drop:
                        - ALL
                      readOnlyRootFilesystem: true
                      runAsGroup: 999
                      runAsNonRoot: true
                      runAsUser: 1000
                      seccompProfile:
                        type: RuntimeDefault
                    volumeMounts:
                    - mountPath: /certs
                      name: cert
                      readOnly: true
                  nodeSelector:
                    kubernetes.io/os: linux
          -         workload: components
                  priorityClassName: system-cluster-critical
                  serviceAccountName: gatekeeper-admin
                  terminationGracePeriodSeconds: 60
          -       tolerations:
          -       - effect: NoSchedule
          -         key: components.gke.io/gke-managed-components
          -         operator: Exists
                  volumes:
                  - name: cert
                    secret:
                      defaultMode: 420
                      secretName: gatekeeper-webhook-server-cert
        EOT
        # (13 unchanged attributes hidden)
    }

  # module.trusted_workload_gatekeeper.kubectl_manifest.gatekeeper["/apis/apps/v1/namespaces/gatekeeper-system/deployments/gatekeeper-audit"] will be updated in-place
  ~ resource "kubectl_manifest" "gatekeeper" {
        id                      = "/apis/apps/v1/namespaces/gatekeeper-system/deployments/gatekeeper-audit"
        name                    = "gatekeeper-audit"
      ~ yaml_body               = (sensitive value)
      ~ yaml_body_parsed        = <<-EOT
            apiVersion: apps/v1
            kind: Deployment
            metadata:
              labels:
                control-plane: audit-controller
                gatekeeper.sh/operation: audit
                gatekeeper.sh/system: "yes"
              name: gatekeeper-audit
              namespace: gatekeeper-system
            spec:
              replicas: 1
              selector:
                matchLabels:
                  control-plane: audit-controller
                  gatekeeper.sh/operation: audit
                  gatekeeper.sh/system: "yes"
              template:
                metadata:
                  labels:
                    control-plane: audit-controller
                    gatekeeper.sh/operation: audit
                    gatekeeper.sh/system: "yes"
                spec:
                  automountServiceAccountToken: true
                  containers:
                  - args:
                    - --operation=audit
                    - --operation=status
                    - --operation=mutation-status
                    - --logtostderr
                    - --disable-opa-builtin={http.send}
                    - --disable-cert-rotation
                    command:
                    - /manager
                    env:
                    - name: POD_NAMESPACE
                      valueFrom:
                        fieldRef:
                          apiVersion: v1
                          fieldPath: metadata.namespace
                    - name: POD_NAME
                      valueFrom:
                        fieldRef:
                          fieldPath: metadata.name
                    - name: NAMESPACE
                      valueFrom:
                        fieldRef:
                          apiVersion: v1
                          fieldPath: metadata.namespace
                    - name: CONTAINER_NAME
                      value: manager
                    image: openpolicyagent/gatekeeper:v3.13.0-beta.0
                    imagePullPolicy: Always
                    livenessProbe:
                      httpGet:
                        path: /healthz
                        port: 9090
                    name: manager
                    ports:
                    - containerPort: 8888
                      name: metrics
                      protocol: TCP
                    - containerPort: 9090
                      name: healthz
                      protocol: TCP
                    readinessProbe:
                      httpGet:
                        path: /readyz
                        port: 9090
                    resources:
                      limits:
                        memory: 512Mi
                      requests:
                        cpu: 100m
                        memory: 512Mi
                    securityContext:
                      allowPrivilegeEscalation: false
                      capabilities:
                        drop:
                        - ALL
                      readOnlyRootFilesystem: true
                      runAsGroup: 999
                      runAsNonRoot: true
                      runAsUser: 1000
                      seccompProfile:
                        type: RuntimeDefault
                    volumeMounts:
                    - mountPath: /certs
                      name: cert
                      readOnly: true
                    - mountPath: /tmp/audit
                      name: tmp-volume
                  nodeSelector:
                    kubernetes.io/os: linux
          -         workload: components
                  priorityClassName: system-cluster-critical
                  serviceAccountName: gatekeeper-admin
                  terminationGracePeriodSeconds: 60
          -       tolerations:
          -       - effect: NoSchedule
          -         key: components.gke.io/gke-managed-components
          -         operator: Exists
                  volumes:
                  - name: cert
                    secret:
                      defaultMode: 420
                      secretName: gatekeeper-webhook-server-cert
                  - emptyDir: {}
                    name: tmp-volume
        EOT
        # (13 unchanged attributes hidden)
    }

  # module.trusted_workload_gatekeeper.kubectl_manifest.gatekeeper["/apis/apps/v1/namespaces/gatekeeper-system/deployments/gatekeeper-controller-manager"] will be updated in-place
  ~ resource "kubectl_manifest" "gatekeeper" {
        id                      = "/apis/apps/v1/namespaces/gatekeeper-system/deployments/gatekeeper-controller-manager"
        name                    = "gatekeeper-controller-manager"
      ~ yaml_body               = (sensitive value)
      ~ yaml_body_parsed        = <<-EOT
            apiVersion: apps/v1
            kind: Deployment
            metadata:
              labels:
                control-plane: controller-manager
                gatekeeper.sh/operation: webhook
                gatekeeper.sh/system: "yes"
              name: gatekeeper-controller-manager
              namespace: gatekeeper-system
            spec:
              replicas: 3
              selector:
                matchLabels:
                  control-plane: controller-manager
                  gatekeeper.sh/operation: webhook
                  gatekeeper.sh/system: "yes"
              template:
                metadata:
                  labels:
                    control-plane: controller-manager
                    gatekeeper.sh/operation: webhook
                    gatekeeper.sh/system: "yes"
                spec:
                  affinity:
                    podAntiAffinity:
                      preferredDuringSchedulingIgnoredDuringExecution:
                      - podAffinityTerm:
                          labelSelector:
                            matchExpressions:
                            - key: gatekeeper.sh/operation
                              operator: In
                              values:
                              - webhook
                          topologyKey: kubernetes.io/hostname
                        weight: 100
                  automountServiceAccountToken: true
                  containers:
                  - args:
                    - --port=8443
                    - --logtostderr
                    - --exempt-namespace=gatekeeper-system
                    - --operation=webhook
                    - --operation=mutation-webhook
                    - --disable-opa-builtin={http.send}
                    command:
                    - /manager
                    env:
                    - name: POD_NAMESPACE
                      valueFrom:
                        fieldRef:
                          apiVersion: v1
                          fieldPath: metadata.namespace
                    - name: POD_NAME
                      valueFrom:
                        fieldRef:
                          fieldPath: metadata.name
                    - name: NAMESPACE
                      valueFrom:
                        fieldRef:
                          apiVersion: v1
                          fieldPath: metadata.namespace
                    - name: CONTAINER_NAME
                      value: manager
                    image: openpolicyagent/gatekeeper:v3.13.0-beta.0
                    imagePullPolicy: Always
                    livenessProbe:
                      httpGet:
                        path: /healthz
                        port: 9090
                    name: manager
                    ports:
                    - containerPort: 8443
                      name: webhook-server
                      protocol: TCP
                    - containerPort: 8888
                      name: metrics
                      protocol: TCP
                    - containerPort: 9090
                      name: healthz
                      protocol: TCP
                    readinessProbe:
                      httpGet:
                        path: /readyz
                        port: 9090
                    resources:
                      limits:
                        memory: 512Mi
                      requests:
                        cpu: 100m
                        memory: 512Mi
                    securityContext:
                      allowPrivilegeEscalation: false
                      capabilities:
                        drop:
                        - ALL
                      readOnlyRootFilesystem: true
                      runAsGroup: 999
                      runAsNonRoot: true
                      runAsUser: 1000
                      seccompProfile:
                        type: RuntimeDefault
                    volumeMounts:
                    - mountPath: /certs
                      name: cert
                      readOnly: true
                  nodeSelector:
                    kubernetes.io/os: linux
          -         workload: components
                  priorityClassName: system-cluster-critical
                  serviceAccountName: gatekeeper-admin
                  terminationGracePeriodSeconds: 60
          -       tolerations:
          -       - effect: NoSchedule
          -         key: components.gke.io/gke-managed-components
          -         operator: Exists
                  volumes:
                  - name: cert
                    secret:
                      defaultMode: 420
                      secretName: gatekeeper-webhook-server-cert
        EOT
        # (13 unchanged attributes hidden)
    }

  # module.untrusted_workload_gatekeeper.kubectl_manifest.gatekeeper["/apis/apps/v1/namespaces/gatekeeper-system/deployments/gatekeeper-audit"] will be updated in-place
  ~ resource "kubectl_manifest" "gatekeeper" {
        id                      = "/apis/apps/v1/namespaces/gatekeeper-system/deployments/gatekeeper-audit"
        name                    = "gatekeeper-audit"
      ~ yaml_body               = (sensitive value)
      ~ yaml_body_parsed        = <<-EOT
            apiVersion: apps/v1
            kind: Deployment
            metadata:
              labels:
                control-plane: audit-controller
                gatekeeper.sh/operation: audit
                gatekeeper.sh/system: "yes"
              name: gatekeeper-audit
              namespace: gatekeeper-system
            spec:
              replicas: 1
              selector:
                matchLabels:
                  control-plane: audit-controller
                  gatekeeper.sh/operation: audit
                  gatekeeper.sh/system: "yes"
              template:
                metadata:
                  labels:
                    control-plane: audit-controller
                    gatekeeper.sh/operation: audit
                    gatekeeper.sh/system: "yes"
                spec:
                  automountServiceAccountToken: true
                  containers:
                  - args:
                    - --operation=audit
                    - --operation=status
                    - --operation=mutation-status
                    - --logtostderr
                    - --disable-opa-builtin={http.send}
                    - --disable-cert-rotation
                    command:
                    - /manager
                    env:
                    - name: POD_NAMESPACE
                      valueFrom:
                        fieldRef:
                          apiVersion: v1
                          fieldPath: metadata.namespace
                    - name: POD_NAME
                      valueFrom:
                        fieldRef:
                          fieldPath: metadata.name
                    - name: NAMESPACE
                      valueFrom:
                        fieldRef:
                          apiVersion: v1
                          fieldPath: metadata.namespace
                    - name: CONTAINER_NAME
                      value: manager
                    image: openpolicyagent/gatekeeper:v3.13.0-beta.0
                    imagePullPolicy: Always
                    livenessProbe:
                      httpGet:
                        path: /healthz
                        port: 9090
                    name: manager
                    ports:
                    - containerPort: 8888
                      name: metrics
                      protocol: TCP
                    - containerPort: 9090
                      name: healthz
                      protocol: TCP
                    readinessProbe:
                      httpGet:
                        path: /readyz
                        port: 9090
                    resources:
                      limits:
                        memory: 512Mi
                      requests:
                        cpu: 100m
                        memory: 512Mi
                    securityContext:
                      allowPrivilegeEscalation: false
                      capabilities:
                        drop:
                        - ALL
                      readOnlyRootFilesystem: true
                      runAsGroup: 999
                      runAsNonRoot: true
                      runAsUser: 1000
                      seccompProfile:
                        type: RuntimeDefault
                    volumeMounts:
                    - mountPath: /certs
                      name: cert
                      readOnly: true
                    - mountPath: /tmp/audit
                      name: tmp-volume
                  nodeSelector:
                    kubernetes.io/os: linux
          -         workload: components
                  priorityClassName: system-cluster-critical
                  serviceAccountName: gatekeeper-admin
                  terminationGracePeriodSeconds: 60
          -       tolerations:
          -       - effect: NoSchedule
          -         key: components.gke.io/gke-managed-components
          -         operator: Exists
                  volumes:
                  - name: cert
                    secret:
                      defaultMode: 420
                      secretName: gatekeeper-webhook-server-cert
                  - emptyDir: {}
                    name: tmp-volume
        EOT
        # (13 unchanged attributes hidden)
    }

  # module.untrusted_workload_gatekeeper.kubectl_manifest.gatekeeper["/apis/apps/v1/namespaces/gatekeeper-system/deployments/gatekeeper-controller-manager"] will be updated in-place
  ~ resource "kubectl_manifest" "gatekeeper" {
        id                      = "/apis/apps/v1/namespaces/gatekeeper-system/deployments/gatekeeper-controller-manager"
        name                    = "gatekeeper-controller-manager"
      ~ yaml_body               = (sensitive value)
      ~ yaml_body_parsed        = <<-EOT
            apiVersion: apps/v1
            kind: Deployment
            metadata:
              labels:
                control-plane: controller-manager
                gatekeeper.sh/operation: webhook
                gatekeeper.sh/system: "yes"
              name: gatekeeper-controller-manager
              namespace: gatekeeper-system
            spec:
              replicas: 3
              selector:
                matchLabels:
                  control-plane: controller-manager
                  gatekeeper.sh/operation: webhook
                  gatekeeper.sh/system: "yes"
              template:
                metadata:
                  labels:
                    control-plane: controller-manager
                    gatekeeper.sh/operation: webhook
                    gatekeeper.sh/system: "yes"
                spec:
                  affinity:
                    podAntiAffinity:
                      preferredDuringSchedulingIgnoredDuringExecution:
                      - podAffinityTerm:
                          labelSelector:
                            matchExpressions:
                            - key: gatekeeper.sh/operation
                              operator: In
                              values:
                              - webhook
                          topologyKey: kubernetes.io/hostname
                        weight: 100
                  automountServiceAccountToken: true
                  containers:
                  - args:
                    - --port=8443
                    - --logtostderr
                    - --exempt-namespace=gatekeeper-system
                    - --operation=webhook
                    - --operation=mutation-webhook
                    - --disable-opa-builtin={http.send}
                    command:
                    - /manager
                    env:
                    - name: POD_NAMESPACE
                      valueFrom:
                        fieldRef:
                          apiVersion: v1
                          fieldPath: metadata.namespace
                    - name: POD_NAME
                      valueFrom:
                        fieldRef:
                          fieldPath: metadata.name
                    - name: NAMESPACE
                      valueFrom:
                        fieldRef:
                          apiVersion: v1
                          fieldPath: metadata.namespace
                    - name: CONTAINER_NAME
                      value: manager
                    image: openpolicyagent/gatekeeper:v3.13.0-beta.0
                    imagePullPolicy: Always
                    livenessProbe:
                      httpGet:
                        path: /healthz
                        port: 9090
                    name: manager
                    ports:
                    - containerPort: 8443
                      name: webhook-server
                      protocol: TCP
                    - containerPort: 8888
                      name: metrics
                      protocol: TCP
                    - containerPort: 9090
                      name: healthz
                      protocol: TCP
                    readinessProbe:
                      httpGet:
                        path: /readyz
                        port: 9090
                    resources:
                      limits:
                        memory: 512Mi
                      requests:
                        cpu: 100m
                        memory: 512Mi
                    securityContext:
                      allowPrivilegeEscalation: false
                      capabilities:
                        drop:
                        - ALL
                      readOnlyRootFilesystem: true
                      runAsGroup: 999
                      runAsNonRoot: true
                      runAsUser: 1000
                      seccompProfile:
                        type: RuntimeDefault
                    volumeMounts:
                    - mountPath: /certs
                      name: cert
                      readOnly: true
                  nodeSelector:
                    kubernetes.io/os: linux
          -         workload: components
                  priorityClassName: system-cluster-critical
                  serviceAccountName: gatekeeper-admin
                  terminationGracePeriodSeconds: 60
          -       tolerations:
          -       - effect: NoSchedule
          -         key: components.gke.io/gke-managed-components
          -         operator: Exists
                  volumes:
                  - name: cert
                    secret:
                      defaultMode: 420
                      secretName: gatekeeper-webhook-server-cert
        EOT
        # (13 unchanged attributes hidden)
    }

Plan: 1 to add, 6 to change, 1 to destroy.
```

</details>





## :warning: Warnings :warning:

```hcl
Warning: "default_secret_name" is no longer applicable for Kubernetes v1.24.0 and above

  with kubernetes_service_account.trusted_workload_terraform_executor,
  on terraform-executor.tf line 42, in resource "kubernetes_service_account" "trusted_workload_terraform_executor":
  42: resource "kubernetes_service_account" "trusted_workload_terraform_executor" {

Starting from version 1.24.0 Kubernetes does not automatically generate a
token for service accounts, in this case, "default_secret_name" will be empty

(and one more similar warning elsewhere)

```






<!-- github-comment: {"Command":"plan","PRNumber":8238,"Program":"tfcmt","SHA1":"187e8a07da54a9d747b2bec5087fa7bd7098aa31","Vars":{}} -->